
&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование актов...";
	Оповещение = Новый ОписаниеОповещения("ОперацияВФонеЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);  
	
	
  			
КонецПроцедуры

&НаСервере 
Функция СоздатьАктыНаСервере()
	
	НаименованиеЗадания = НСтр("ru = 'Формирование актов'");
	ИмяФункции = "Обработки.ВКМ_МассовоеСозданиеАктов.СозданныеАкты";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ИмяФункции;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяФункции,ПараметрыПроцедуры);
		
КонецФункции 

 &НаКлиенте
Процедура ОперацияВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Если Результат.Статус = "Выполнено" Тогда
		ДлительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Формирование документов реализации выполнено успешно");
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Статус операции: ошибка выпонения, обратитесь с системному администратору");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 
Процедура ДлительныеОперацииЗавершениеНаСервере(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	СсылкаНаДокумент = Результат;
 
	Объект.СписокРеализаций.Очистить();
	
    Для Каждого Строка Из СсылкаНаДокумент Цикл
	НоваяСтрока = Объект.СписокРеализаций.Добавить();
	НоваяСтрока.Договор = Строка.Договор;
	НоваяСтрока.Ссылка = Строка.Ссылка;
	КонецЦикла; 
	
КонецПроцедуры




                                                                       