

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТГБот.Текст,
	|	ВКМ_ТокенТГБот.Значение КАК TokenTG,
	|	ВКМ_ИдентификаторГруппыТГ.Значение КАК Chat_id,
	|	ВКМ_УведомленияТГБот.Ссылка
	|ИЗ
	|	Константа.ВКМ_ИдентификаторГруппыТГ КАК ВКМ_ИдентификаторГруппыТГ,
	|	Константа.ВКМ_ТокенТГБот КАК ВКМ_ТокенТГБот,
	|	Справочник.ВКМ_УведомленияТГБот КАК ВКМ_УведомленияТГБот";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	TokenTG = Выборка.TokenTG;
	Chat_id = Выборка.Chat_id;
	ТекстСообщения = Выборка.Текст;
	
	АдресТГ = "api.telegram.org";
	Соединение = Новый HTTPСоединение(АдресТГ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL( ));
	Данные = Новый Структура;
	Данные.Вставить("text", ТекстСообщения);
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	АдресЗапроса = "bot" +TokenTG+ "/sendMessage?chat_id="+Формат(Chat_id,"ЧГ=");
	Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Попытка
	Результат = Соединение.ОтправитьДляОбработки(Запрос);	
	
	Если Не Результат.КодСостояния = 200 Тогда
			ВызватьИсключение "Ошибка проверки связи";
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю("Уведомление отправлено в чат специалистов");
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();
		
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка! Повторите отправку уведомления в чат");
		
		Возврат	 
	КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



	
	
