
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
   Если ЭтоАдресВременногоХранилища(АдресПечати) Тогда 
   	ДанныеПечати = ПолучитьИзВременногоХранилища(АдресПечати);
   	ТекущийОбъект.Печать = Новый ХранилищеЗначения(ДанныеПечати, Новый СжатиеДанных(9));
   ИначеЕсли ПустаяСтрока(АдресПечати) Тогда
   	ТекущийОбъект.Печать = Неопределено;
   КонецЕсли;
   
   Если ЭтоАдресВременногоХранилища(АдресПодписи) Тогда 
   	ДанныеПодписи = ПолучитьИзВременногоХранилища(АдресПодписи);
   	ТекущийОбъект.Подпись = Новый ХранилищеЗначения(ДанныеПодписи, Новый СжатиеДанных(9));
   ИначеЕсли ПустаяСтрока(АдресПодписи) Тогда
   	ТекущийОбъект.Подпись = Неопределено;
   КонецЕсли;
   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
 АдресПодписи =ПолучитьНавигационнуюСсылку(ТекущийОбъект, "Подпись");
 АдресПечати =ПолучитьНавигационнуюСсылку(ТекущийОбъект, "Печать");
 
КонецПроцедуры

&НаКлиенте
Процедура АдресПодписиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Файл | *.jpg; *.jpeg; *.png";
	
	ЧтоДелатьПосле = Новый ОписаниеОповещения("ПослеВыбораФайлаПодписи", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЧтоДелатьПосле,,,,ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиенте
Процедура АдресПечатиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Файл | *.jpg; *.jpeg; *.png";
	
	ЧтоДелатьПосле = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЧтоДелатьПосле,,,,ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла (ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресПечати = ОписаниеПомещенногоФайла.Адрес;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаПодписи (ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресПодписи = ОписаниеПомещенногоФайла.Адрес;
	
	
КонецПроцедуры






