

#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	СпециалистПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпециалистПриИзмененииНаСервере()
	ПолучениеПроцентаОтРабот();	
КонецПроцедуры

&НаСервере
Процедура ПолучениеПроцентаОтРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Специалисту %2 установлен процент от выполненных работ в размере %1 процентов", Выборка.ПроцентОтРабот, Выборка.Специалист));
			
	КонецЦикла;

КонецПроцедуры


                           
&НаСервере
 Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 	
    Запрос = Новый Запрос;
	Запрос.Текст = ("ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор = &Ссылка" );
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ПолучениеПроцентаОтРабот();

КонецПроцедуры

#КонецОбласти