

#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если Объект.Проведен = Истина Тогда
	Текст = СтрШаблон("Изменилась дата документа № %2 новая дата %1", Объект.Дата, Объект.Номер);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
	ВКМ_ИнтеграцияТГ.ОтправитьСообщение();
	Иначе
	Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	СпециалистПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпециалистПриИзмененииНаСервере()
	
	ПолучениеПроцентаОтРабот();
	
	Если Объект.Проведен = Истина Тогда
	Текст = СтрШаблон("Изменился специалист по документу №%2 на %1", Объект.Специалист, Объект.Номер);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
	ВКМ_ИнтеграцияТГ.ОтправитьСообщение();
	Иначе
	Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеПроцентаОтРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Специалисту %2 установлен процент от выполненных работ в размере %1 процентов", Выборка.ПроцентОтРабот, Выборка.Специалист));
			
	КонецЦикла;

КонецПроцедуры


                           
&НаСервере
 Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 	
    Запрос = Новый Запрос;
	Запрос.Текст = ("ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор = &Ссылка" );
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ПолучениеПроцентаОтРабот();

КонецПроцедуры

#КонецОбласти