
#Область  ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗАПОЛНИТЬ(Команда)
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда  
		
	ЗАПОЛНИТЬНаСервере();
	
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подразделение не заполнено! Автоматическое заполнение документа не возможно");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗАПОЛНИТЬНаСервере()
	
	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	|		ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_ФизическиеЛица.Ссылка
	|ГДЕ
	|	ВКМ_ФизическиеЛица.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	|ГДЕ
	|	ВКМ_ФизическиеЛица.Подразделение = &Подразделение"; 

    Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", (НачалоМесяца(КонецДня(Объект.Дата))));
	Запрос.УстановитьПараметр("КонецПериода", (КонецМесяца(КонецДня(Объект.Дата))));
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаДополнительныеНачисления = МассивРезультатов[0].Выбрать();
	ВыборкаОсновныеНачисления = МассивРезультатов[1].Выбрать();
	
	
	Пока ВыборкаДополнительныеНачисления.Следующий() Цикл
		
		НоваяСтрока = Объект.ДополнительныеНачисления.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДополнительныеНачисления.Сотрудник;
		НоваяСтрока.СуммаНачисления = ВыборкаДополнительныеНачисления.СуммаКОплатеПриход;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПремияОтПродаж;
		
	КонецЦикла; 
	
	Пока ВыборкаОсновныеНачисления.Следующий() Цикл
		
		НоваяСтрока = Объект.ОсновныеНачисления.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаОсновныеНачисления.Сотрудник;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
