

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Адрес = Параметры.Адрес;
ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));

ДГ.Очистить();
ДГ.Обновление = Ложь;

Для Каждого Строка Из ОтпускаСотрудников Цикл

ТочкаДГ = ДГ.УстановитьТочку(Строка.Сотрудник);
СерияДГ = ДГ.УстановитьСерию("Отпуск");

Значение = ДГ.ПолучитьЗначение(ТочкаДГ, СерияДГ);

Интервал = Значение.Добавить();
Интервал.Начало = Строка.ДатаНачала;
Интервал.Конец = Строка.ДатаОкончания;

КонецЦикла;

ДГ.Обновление = Истина;

КонецПроцедуры






