
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ПОМЕСТИТЬ ВТ_ПроцентПоСотруднику
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеПоДоговору
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		И ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец
	|		И ВКМ_ОбслуживаниеКлиента.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И (ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ ДоговорыКонтрагентов.ВКМ_ПериодС И ДоговорыКонтрагентов.ВКМ_По
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоДоговору.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ВТ_ПроцентПоСотруднику.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	ВТ_ПроцентПоСотруднику КАК ВТ_ПроцентПоСотруднику,
	|	ВТ_ДанныеПоДоговору КАК ВТ_ДанныеПоДоговору";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верная дата!");
		
	
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Сторока Из ВыполненныеРаботы Цикл
			
		СуммаКОплате = Выборка.ВКМ_СтоимостьЧасаРаботы * Сторока.ЧасыКОплатеКлиенту;
		
		КонецЦикла;
		
	КонецЦикла;
	
		
		
КонецЕсли;
	
	Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
	
         //ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * Выборка.ВКМ_СтоимостьЧасаРаботы * Выборка.ПроцентОтРабот/100;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		
		//Регистр ВыполненныеРаботыКлиенту
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
	    Движение.СуммаКОплате = СуммаКОплате;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		
	КонецЦикла;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();

    

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
    
    Текст = СтрШаблон("Создан документ дата  %1, специалист %2", Дата, Специалист);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


