
#Область ОписаниеПеременных
Перем СтарыйСпециалист;
Перем СтараяДатаРабот;
#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ПОМЕСТИТЬ ВТ_ПроцентПоСотруднику
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеПоДоговору
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		И ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец
	|		И ВКМ_ОбслуживаниеКлиента.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ ДоговорыКонтрагентов.ВКМ_ПериодС И ДоговорыКонтрагентов.ВКМ_По
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов) КАК ФактическиПотраченоЧасов,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
	|ПОМЕСТИТЬ ВТ_СверткаТабЧасти
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоДоговору.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ВТ_ПроцентПоСотруднику.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВТ_СверткаТабЧасти.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВТ_СверткаТабЧасти.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
	|ИЗ
	|	ВТ_ПроцентПоСотруднику КАК ВТ_ПроцентПоСотруднику,
	|	ВТ_ДанныеПоДоговору КАК ВТ_ДанныеПоДоговору,
	|	ВТ_СверткаТабЧасти КАК ВТ_СверткаТабЧасти";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верная дата!");
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СуммаКОплате = Выборка.ВКМ_СтоимостьЧасаРаботы * Выборка.ЧасыКОплатеКлиенту; 
			
			//ВыполненныеСотрудникомРаботы
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.ВКМ_СтоимостьЧасаРаботы * Выборка.ПроцентОтРабот/100;
			Движение.Сотрудник = Специалист;
			Движение.ЧасовКОплате = Выборка.ФактическиПотраченоЧасов;
			
			//Регистр ВыполненныеРаботыКлиенту
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.СуммаКОплате = СуммаКОплате;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			
		КонецЦикла;
		
	КонецЕсли;  
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//При изменениии даты и специалиста
	
	Если СтараяДатаРабот <> Неопределено И СтараяДатаРабот <> ДатаПроведенияРабот Тогда
		СоздатьУведомлениеКлиентуДата();  
	КонецЕсли;
	
	Если СтарыйСпециалист <> Неопределено И СтарыйСпециалист <> Специалист Тогда
		СоздатьУведомлениеКлиентуСпециалист();  
	КонецЕсли; 

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Первичная отправка при создании нового документа
	Если ЭтоНовый() Тогда
    
    Текст = СтрШаблон("Создан документ от %1, специалист %3, произвести работы %4", Дата, Специалист, ДатаПроведенияРабот);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
    КонецЕсли;

   //Проверка на "новую" дату и специалиста запросом      
   Если Не ЭтоНовый() Тогда
	   
	   Запрос = Новый Запрос;
	   Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК СтараяДатаРабот,
	   |	ВКМ_ОбслуживаниеКлиента.Специалист КАК СтарыйСпециалист
	   |ИЗ
	   |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	   |ГДЕ
	   |	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	   
	   Запрос.УстановитьПараметр("Ссылка", Ссылка);
	   
	   Выборка = Запрос.Выполнить().Выбрать();
	   
	   Если Выборка.Следующий() Тогда
		   СтараяДатаРабот = Выборка.СтараяДатаРабот; 
		   СтарыйСпециалист = Выборка.СтарыйСпециалист;	
	   КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

Процедура СоздатьУведомлениеКлиентуСпециалист() 
	
	Текст = СтрШаблон("Изменен специалист на  %2, по документу № %3, от %1", Дата, Специалист, Номер);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
КонецПроцедуры

Процедура СоздатьУведомлениеКлиентуДата() 
	
	Текст = СтрШаблон("Изменена дата проведения работ на %2, по документу № %3, от %1", Дата, ДатаПроведенияРабот, Номер);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
КонецПроцедуры


#КонецОбласти

